ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p55x_aes_ss_regs.xml
<module id="AES_SS_REGS" HW_revision="" description="AES SS Registers">
	<register id="AES_GLB_INT_FLG" width="32" page="1" offset="0x2" internal="0" description="AES Global Interrupt Flag Register">
		<bitfield id="INT_FLG" description="Global Interrupt Flag for AES Interrupt" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="AES_GLB_INT_CLR" width="32" page="1" offset="0x4" internal="0" description="AES Global Interrupt Clear Register">
		<bitfield id="INT_FLG_CLR" description="Global Interrupt flag clear for AES Interrupt" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
